app/views/houses/show.html.erb

<ul>
  <% @house.characters.each do |character| %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."house_id" = $1  [["house_id", 8]]