app/controllers/houses_controller.rb

  def create
    @house = House.create!(house_params)
---
INSERT INTO "houses" ("name", "sigil") VALUES ($1, $2) RETURNING "id"  [["name", "Test"], ["sigil", "pencil"]]